const ComplicationPrev = () => {
  return (
    <div>
      <div>
        <p className="font-bold text-green-700">الكشف المبكر عن مرض السكري:</p>
        <p>
          يعد هذا الإجراء هو الأهم كون الكثير من مرضى السكري من النوع الثاني لا
          يعرفون لسنوات أنهم مصابون بالسكري إلا بعد ظهور بعض المضاعفات للأسف
          الشديد مما يجعل علاجهم معقدا ومكلفا .
        </p>
        <p>
          يمكننا أن نساهم في الكشف المبكر عن طريق حث وتشجيع أنفسنا وأقاربنا
          وأحبابنا على المشاركة في الحملات التحسيسية والكشف عن السكري أو القيام
          بتحاليل دورية يصفها لنا الطبيب وعدم التهاون في ذلك.
        </p>
      </div>
      <div className="mt-2">
        <p className="text-green-700">
          المراقبة المستمرة لمستوى السكر في الدم والألتزام بالعلاج:
        </p>
        <p>
          يمكن تجنب المضاعفات أو تأخيرها بضمان أن تكون نسبة السكري طبيعية وغير
          مرتفعة وإستشارة الطبيب المعالج لتعديل العلاج إن دعت الضرورة.
        </p>
        <p className="text-red-700">
          لا فرق بين شخص يتناول العلاج ولا يراقب مستوى السكر لديه دوريا وبين شخص
          مريض يجهل أنه مصاب بالسكري فكلاهما يتجهان بخطى ثابتة نحو مضاعفات
          السكري.
        </p>
        <p>
          تكون المراقبة المستمرة بالإلتزام بمواعيد وتحاليل الطبيب المعالج
          والقيام دوريا بقياس السكر في الدم بنفسه بإستعمال أجهزة قياس السكري.
        </p>
      </div>
      <div className="mt-2">
        <p className="font-bold text-green-700">تجنب التداوي الذاتي:</p>
        <p>
          التداوي الذاتي هو شراء وتناول دواء بدون وصفة من الطبيب، المسؤول الأول
          عن التداوي الذاتي هو الصيدلي ويمكن تجنب مخاطره إذا كان الصيدلي ذو
          كفاءة، لكن المشكلة في الجزائر أن كثيرا من العاملين في الصيدليات ليسوا
          بصيادلة بل باعة يملكون تكوينا محدودا لا يسمح لهم بإعطاء أدوية للمرضى
          مما يجعل مخاطر التداوي الذاتي أكبر.
        </p>
        <p className="text-red-700">مثال عن خطورة التداوي الذاتي:</p>
        <p>
          مبروك جزائري عمره 43 سنة شخص بإصابته بمرض السكري النوع الثاني، الطبيب
          المعالج وصف له غلوكوفاج 1000 مغ ، بعد الالتزام بمواعيد الطبيب وعلاجه
          إستقرت حاله، لكنه قرر بعد فترة التوقف عن زيارة الطبيب وإكتفى بشراء
          الدواء بنفسه من الصيدلية كون سعره رخيص جدا مقارنة بسعر تحاليل الطبيب
          المختص أو سعر الزيارة وإحتجاجه أن الطبيب يعطيه نفس العلاج كل مرة، بعد
          مرور سنوات وهو على هذه الحال أصيب المبروك بوعكة صحية مفاجئة نقل على
          إثرها إلى المستشفى، الأطباء شخصوا أن مبروك أصيب بغيبوبة ناتجة عن تراكم
          حمض اللاكتيك وبعد عمل التحاليل وجدوا أن وظيفة الكلى كانت متدهورة.
        </p>
        <p className="text-red-700">أين أخطأ المبروك هنا؟</p>
        <p>
          المبروك ظن أن وظيفة الطبيب إعطاء الدواء فقط ولم يدرك أن الطبيب يتابع
          حالته من خلال الفحص والتحاليل ليضمن تجنب مضاعفات السكري وليضمن أن ليس
          لديه موانع ضد الدواء الذي يتناوله حتى لا يسبب له مضاعفات لا تحمد
          عقباها، المبروك توقف عن زيارة الطبيب وبالتالي توقف عن مراقبة حالته
          <span className="text-red-700">
            {" "}
            ولأنه ظن أن إختفاء أعراض السكري يعني أنه مستقر
          </span>{" "}
          بقي لديه مستوى السكر في الدم مرتفعا لسنوات مما سبب له قصورا في وظيفة
          الكلى وهذا القصور هو أحد أهم موانع دواء غلوكوفاج.
        </p>
        <p>
          وجود قصور حاد في الكلى مع تناول غلوكوفاج يعني تراكم حمض اللاكتيك في
          الدم وبالتالي إحتمالية حدوث إحدى المضاعفات الخطيرة وهي غيبوبة حمض
          اللاكتيك،<span className="text-green-700"> لا تكن مثل المبروك!</span>
        </p>
      </div>
      <div className="mt-2">
        <p className="text-green-700">الإلتزام بأكل صحي ونشاط بدني منتظم:</p>
        <p>
          أكل فيه القليل من السكريات والدهون يساعد في إستقرار السكر في الدم
          ويطيل من قدرة البنكرياس على العمل وعدم الحاجة إلى الأنسولين من الخارج.
        </p>
        <p>
          شرب الماء بإنتظام يساهم في الوقاية من الجفاف الذي يعتبر أحد أهم
          العوامل المحفزة لمضاعفات السكري، خاصة كبار السن الذين يكون عندهم
          الشعور بالعطش منخفضا، فعليهم شرب السوائل بإنتظام حتى وإن كانوا لا
          يشعرون بالعطش.
        </p>
        <p>
          النشاط البدني المنتظم لنصف ساعة كل يوم مهم جدا لإستقرار السكر وبالتالي
          تجنب المضاعفات.
        </p>
      </div>
      <div className="mt-2">
        <p className="text-green-700">الإهتمام بالقدمين:</p>
        <p>
          من أكثر المضاعفات التي يقابلها الأطباء الجزائريون هي القدم السكرية
          نتيجة قلة الإهتمام من مرضى السكري بأقدامهم.
        </p>
        <p>
          قدم مريض السكري حساسة جدا وأي عدوى أو جرح لا يعالج بشكل صحيح قد تتطور
          إلى قدم سكرية يصعب علاجها وقد تنتهي بالقطع!
        </p>
        <p>
          يمكن تجنب القدم السكرية بإتخاذ إجراءات وقائية مثل لبس أحذية صلبة
          ومريحة وغير ضيقة تغطي كامل القدم حتى في المنزل، ومتابعة دورية لحالة
          الأضافر وسلامتها من أي عدوى، وإستشارة الطبيب في حالة أي جرح أو عدوى.
        </p>
      </div>
      <div className="mt-2">
        <p className="text-green-700">
          الألتزام بالتطعيمات وإستشارة الطبيب عند أي مرض:
        </p>
        <p>
          العدوى البكتيرية أو الفيروسية يمكن أن تكون عاملا قويا في إحداث مضاعفات
          خطيرة للسكري، لذا التطيعمات والعلاج السريع من الطبيب يلعبون دورا مهما
          في تجنبها.
        </p>
      </div>
    </div>
  );
};

export default ComplicationPrev;
