const Symptoms = () => {
  return (
    <div>
      <p>
        يمكن للأعراض أن تظهر فجأة أو{" "}
        <span className="text-red-700">
          في حالة السكري النوع الثاني تكون خفيفة ولا تلاحظ إلا بعد مرور سنوات!!!
        </span>{" "}
        أي أن كثيرا من مرضى السكري يكونون مصابين بالمرض ولا يدرون بذلك حتى
        تتدهور حالتهم،{" "}
        <span className="text-green-700">
          وهنا تأتي أهمية الحملات التحسيسية و حملات الكشف عن السكري.
        </span>
      </p>
      <div className="mt-2">
        من بين أعراض السكري:
        <ul className="mb-2 list-inside list-disc">
          <li>الإحساس بالعطش الشديد</li>
          <li>التبول الكثير والمتكرر</li>
          <li>رؤية ضبابية</li>
          <li>شعور مزمن بالتعب</li>
          <li>وفقدان في الوزن بشكل غير طبيعي</li>
        </ul>
      </div>
      <p>
        مع مرور الوقت يسبب إرتفاع السكر في الدم إختلالات في القلب والأوعية
        والعينين والكليتين والأعصاب مما يؤدي إلى ظهور أعراض وأمراض مرتبطة بهذه
        الإختلالات مثل فقدان الرؤية، آلام مزمنة لا يمكن تفسيرها، ذبحة صدرية
        وذبحة دماغية وقصور في وظائف الكلى، قد تظهر كذلك تقرحات وتعفنات في
        القدمين نتيجة تضرر الأعصاب والأوعية الدموية.
      </p>
    </div>
  );
};

export default Symptoms;
