const Types = () => {
  return (
    <div>
      <p>توجد أنواع كثيرة لمرض السكري لكن أكثرها شيوعا وإنتشارا نوعان:</p>
      <p className="mt-2 text-green-700">مرض السكري النوع الأول: </p>
      <p>
        يتميز بإنتاج منعدم أو غير كافي للأنسولين من طرف البنكرياس ، وهو مرض
        مناعي تكون فيه خلايا البنكرياس قد تعرضت للهجوم والتخريب من طرف الجهاز
        المناعي، أسباب حدوث هذا النوع غير معروفة ولازلنا لا نعرف كيف نتجنبه
        وكيفية الوقاية منه.
      </p>
      <p className="text-red-700">
        يشتهر هذا النوع عند الأطفال لكن يمكن أن يصيب كبار السن كذلك .
      </p>
      <p>يمثل قلة من مرضى السكري بنسبة 5 بالمئة إلى 10 بالمئة من المرضى.</p>
      <p className="mt-2 text-green-700">مرض السكري النوع الثاني:</p>
      <p>
        يمثل أغلبية مرضى السكري بنسبة تتراوح بين 90 بالمئة و95 بالمئة من مجموع
        المرضى، يتميز بفقدان هرمون الأنسولين قدرته على خفض السكر في الدم نتيجة
        وجود مقاومة من خلايا الجسم لعمل الهرمون مما يؤدي إلى إرتفاع مزمن في
        السكر في الدم إذا لم يعالج يؤدي بمرور الوقت إلى مضاعفات عدة.
      </p>
      <p className="text-red-700">
        يشتهر هذا النوع عند البالغين، لكن بدأنا نسجل حالات أكثر وأكثر للسكري نوع
        2 عند الأطفال بسبب السمنة والنمط الغذائي السيئ ونقص النشاط البدني.
      </p>
    </div>
  );
};

export default Types;
